{
    "title": "Fire Breath Hero",
    "description": "Leo is a young prince who must learn to breathe fire to save his kingdom from a terrible winter that never ends. With the help of an old dragon, Leo goes on a journey to find his inner fire and bring warmth back to his people.",
    "level": "Early Beginner",
    "genre": "fantasy, adventure",
    "episodeQuantity": 7,
    "episodeTitles": [
        {
            "episode1": "The Cold Kingdom",
            "episode2": "The Old Story",
            "episode3": "Meeting the Dragon",
            "episode4": "First Lesson",
            "episode5": "The Hard Practice",
            "episode6": "The Test",
            "episode7": "Warm Again"
        }
    ],
    "episodeContents": [
        {
            "episode1": [
                {
                    "page1": [
                        {
                            "paragraph1": "It is always winter in Leo's kingdom. Snow falls every day. Ice covers the river. People are cold and hungry.",
                            "paragraph2": "Leo is the young prince. He sits by the window in the castle. He watches the snow fall.",
                            "paragraph3": "\"Prince Leo,\" a voice calls. It is Maya, the old woman who works in the castle.",
                            "paragraph4": "\"Yes, Maya?\" Leo asks.",
                            "paragraph5": "\"Your father wants to see you,\" Maya says. \"The king is in the great hall.\"",
                            "paragraph6": "Leo follows Maya to the great hall. His father, King Ren, sits on his throne. He looks tired.",
                            "paragraph7": "\"Leo,\" the king says. \"Our kingdom is in danger. The winter is too long. Our food is almost gone.\"",
                            "paragraph8": "\"What can we do?\" Leo asks.",
                            "paragraph9": "\"There is only one way to save our kingdom,\" King Ren says. \"Someone must learn to breathe fire. The fire will bring warmth back to our land.\"",
                            "paragraph10": "\"Breathe fire?\" Leo is confused. \"But only dragons can breathe fire.\"",
                            "paragraph11": "\"That is not true,\" the king says. \"Long ago, the kings and queens of our family could breathe fire too.\""
                        }
                    ]
                }
            ],
            "episode2": [
                {
                    "page1": [
                        {
                            "paragraph1": "Leo sits with his father by the fire. The king tells him an old story.",
                            "paragraph2": "\"Many years ago, our kingdom was always warm,\" King Ren says. \"The first king, your great-grandfather, could breathe fire. His fire kept the kingdom warm all year.\"",
                            "paragraph3": "\"What happened?\" Leo asks.",
                            "paragraph4": "\"The king grew old. Before he died, he taught his son to breathe fire. This continued for many years.\"",
                            "paragraph5": "\"Then why is it winter now?\" Leo asks.",
                            "paragraph6": "The king looks sad. \"I failed to learn. My father tried to teach me, but I could not do it. Then he died, and the winter came.\"",
                            "paragraph7": "\"So I must learn?\" Leo asks.",
                            "paragraph8": "\"Yes,\" the king says. \"You must go to the mountains. Find the old dragon who lives there. Ask him to teach you.\"",
                            "paragraph9": "\"A real dragon?\" Leo's eyes grow wide.",
                            "paragraph10": "\"Yes,\" the king says. \"The dragon taught our family long ago. He may still be alive.\"",
                            "paragraph11": "\"I will go,\" Leo says. \"I will learn to breathe fire and save our kingdom.\""
                        }
                    ]
                }
            ],
            "episode3": [
                {
                    "page1": [
                        {
                            "paragraph1": "Leo packs a bag with warm clothes and food. He puts on his thickest coat and boots.",
                            "paragraph2": "\"Be careful,\" the king says. \"The mountain is dangerous.\"",
                            "paragraph3": "\"I will,\" Leo promises.",
                            "paragraph4": "Leo walks for many days. The snow is deep. The wind is cold. Finally, he reaches the mountain.",
                            "paragraph5": "A cave sits at the top of the mountain. Smoke comes from inside. Leo climbs up to the cave.",
                            "paragraph6": "\"Hello?\" Leo calls into the cave. \"Is anyone here?\"",
                            "paragraph7": "A deep voice answers. \"Who comes to my cave?\"",
                            "paragraph8": "Leo steps inside. It is warm in the cave. In the back, a huge dragon lies on a bed of gold coins. The dragon is red and gold. His eyes are bright yellow.",
                            "paragraph9": "\"I am Prince Leo,\" Leo says. His voice shakes a little. \"I come to ask for your help.\"",
                            "paragraph10": "\"Ah,\" the dragon says. \"Another prince. Your father failed to learn. Why should I teach you?\"",
                            "paragraph11": "\"Because our people are cold and hungry,\" Leo says. \"I must save them.\""
                        }
                    ]
                }
            ],
            "episode4": [
                {
                    "page1": [
                        {
                            "paragraph1": "The dragon looks at Leo for a long time. Then he nods.",
                            "paragraph2": "\"You have a good heart,\" the dragon says. \"I will teach you. My name is Flame.\"",
                            "paragraph3": "\"Thank you, Flame,\" Leo says.",
                            "paragraph4": "\"First, you must understand fire,\" Flame says. \"Fire comes from inside. From your heart.\"",
                            "paragraph5": "\"From my heart?\" Leo puts his hand on his chest.",
                            "paragraph6": "\"Yes,\" Flame says. \"You must feel the fire in your heart first. Close your eyes.\"",
                            "paragraph7": "Leo closes his eyes.",
                            "paragraph8": "\"Think of something that makes you feel warm inside,\" Flame says. \"Something that makes you happy.\"",
                            "paragraph9": "Leo thinks. He thinks about his mother's smile. His father's laugh. The people in his kingdom when they were happy.",
                            "paragraph10": "\"I feel something,\" Leo says. \"A warm feeling in my chest.\"",
                            "paragraph11": "\"Good,\" Flame says. \"That is your inner fire. Now, try to move that feeling up to your mouth.\""
                        }
                    ]
                }
            ],
            "episode5": [
                {
                    "page1": [
                        {
                            "paragraph1": "Leo practices every day. He feels the warm feeling in his chest. He tries to move it up to his mouth.",
                            "paragraph2": "\"Now breathe out!\" Flame instructs.",
                            "paragraph3": "Leo breathes out hard. Nothing happens.",
                            "paragraph4": "\"Again,\" Flame says. \"Feel the fire. Move it up. Breathe out.\"",
                            "paragraph5": "Leo tries again. And again. For days, nothing happens.",
                            "paragraph6": "\"I can't do it,\" Leo says one night. He feels sad. \"I'm going to fail, just like my father.\"",
                            "paragraph7": "\"No,\" Flame says. \"You are different. You care deeply about your people. Think about them when you try.\"",
                            "paragraph8": "The next day, Leo tries again. This time, he thinks about the children in his kingdom, cold and hungry.",
                            "paragraph9": "The warm feeling in his chest grows stronger. It moves up to his throat. His mouth feels hot.",
                            "paragraph10": "Leo breathes out hard.",
                            "paragraph11": "A small flame comes out of his mouth! It only lasts for a second, but it is fire!",
                            "paragraph12": "\"I did it!\" Leo shouts.",
                            "paragraph13": "\"Yes!\" Flame says. \"Now practice more. Make the flame bigger and last longer.\""
                        }
                    ]
                }
            ],
            "episode6": [
                {
                    "page1": [
                        {
                            "paragraph1": "After many more days of practice, Leo's fire grows stronger. He can now breathe a big flame that lasts for many seconds.",
                            "paragraph2": "\"You are ready for the test,\" Flame says.",
                            "paragraph3": "\"What test?\" Leo asks.",
                            "paragraph4": "\"You must light the Great Fire,\" Flame explains. \"It sits at the top of the highest tower in your castle. When it burns, it will warm the whole kingdom.\"",
                            "paragraph5": "\"But the tower is very high,\" Leo says. \"The wind is strong there. My fire may go out.\"",
                            "paragraph6": "\"That is why it is a test,\" Flame says. \"You must make your fire strong enough to light the Great Fire, even in the wind.\"",
                            "paragraph7": "Leo practices more. He learns to make his fire hotter and stronger.",
                            "paragraph8": "\"I am ready,\" Leo says finally.",
                            "paragraph9": "\"Go,\" Flame says. \"Save your kingdom.\"",
                            "paragraph10": "Leo thanks the dragon and begins the long journey home. The snow is still deep. The wind is still cold. But now Leo has fire inside him. He is never cold."
                        }
                    ]
                }
            ],
            "episode7": [
                {
                    "page1": [
                        {
                            "paragraph1": "Leo arrives at the castle. His father hugs him.",
                            "paragraph2": "\"You look different,\" King Ren says. \"Did you learn?\"",
                            "paragraph3": "Leo nods. He breathes out a small flame to show his father.",
                            "paragraph4": "\"Wonderful!\" the king cries. \"Now you must light the Great Fire.\"",
                            "paragraph5": "Together, they climb the steps to the highest tower. On top sits a huge bowl made of stone. It is filled with wood and oil.",
                            "paragraph6": "\"This is the Great Fire,\" the king says. \"It has not burned for twenty years.\"",
                            "paragraph7": "The wind at the top of the tower is very strong. It pushes against Leo.",
                            "paragraph8": "Leo closes his eyes. He feels the fire in his heart. He thinks about his people, his kingdom. The fire grows strong inside him.",
                            "paragraph9": "Leo opens his mouth and breathes out. A huge flame shoots from his mouth. It hits the Great Fire. The wood and oil catch fire immediately.",
                            "paragraph10": "The Great Fire burns high and bright. Heat spreads from the tower.",
                            "paragraph11": "\"You did it!\" the king shouts. Tears are in his eyes.",
                            "paragraph12": "Below, the people cheer. Already, the snow begins to melt. The ice on the river cracks.",
                            "paragraph13": "\"Spring is coming,\" Leo says with a smile.",
                            "paragraph14": "The kingdom is saved. Because Leo found his inner fire, warmth returns to the land. The people are happy again. And Prince Leo knows that one day, he will teach his own child to breathe fire, just as Flame taught him."
                        }
                    ]
                }
            ]
        }
    ]
}