{
    "title": "The Shadow Lady",
    "description": "The story of Elena, a mysterious woman whose charm and secrets give her unexpected power",
    "level": "Intermediate",
    "genre": "police, romance",
    "episodeQuantity": 5,
    "episodeTitles": [
        {
            "episode1": "The Stranger",
            "episode2": "Whispers in Town",
            "episode3": "The Detective's Heart",
            "episode4": "Secrets Revealed",
            "episode5": "The Final Game"
        }
    ],
    "episodeContents": [
        {
            "episode1": [
                {
                    "page1": [
                        {
                            "paragraph1": "Elena Santos arrived in the small town of Riverside on a rainy Tuesday. No one knew where she came from. No one knew why she chose this quiet place. She stepped off the bus with only one black suitcase and a smile that made men stop and stare.",
                            "paragraph2": "The town had not seen someone like her before. Her long dark hair moved in the wind. Her red dress was bright against the gray day. When she walked, people turned to watch.",
                            "paragraph3": "Elena rented room 12 at the Blue Moon Hotel. Mrs. Wilson, the old woman who owned the hotel, looked at Elena with suspicious eyes. 'How long will you stay?' she asked.",
                            "paragraph4": "Elena smiled. Her lips were as red as her dress. 'I never plan too far ahead, Mrs. Wilson. Life is more interesting that way, don't you think?'",
                            "paragraph5": "Mrs. Wilson did not smile back. She gave Elena the key and watched her walk up the stairs. Later, Mrs. Wilson called her friend who worked at the police station. 'Martha, we have a strange new woman in town. I don't trust her. Tell Detective Parker to keep an eye on her.'"
                        }
                    ],
                    "page2": [
                        {
                            "paragraph1": "Elena unpacked her few things in room 12. She placed a small wooden box on the table next to her bed. The box had a lock but no key. She touched it gently, like it was precious.",
                            "paragraph2": "After unpacking, Elena went to the only restaurant in town - Joe's Diner. When she walked in, the loud conversations stopped. All eyes turned to her. Elena smiled, enjoying the attention.",
                            "paragraph3": "She sat alone at a table by the window. Joe, the owner, came to take her order. He was a big man with a usually serious face. But when Elena looked up at him and said, 'What do you recommend?' in her soft voice, Joe's face turned red like a schoolboy's.",
                            "paragraph4": "'The... the chicken soup is good. My wife's recipe,' Joe managed to say.",
                            "paragraph5": "'Then I must try it,' Elena said. Her accent was slight but exotic.",
                            "paragraph6": "At another table, a man in a blue shirt watched Elena carefully. This was Detective Michael Parker. Martha from the police station had called him about the mysterious new woman. Michael was 35 years old, divorced, and the town's only detective. Not much happened in Riverside, so a stranger always meant something interesting."
                        }
                    ],
                    "page3": [
                        {
                            "paragraph1": "While Elena ate her soup, Michael watched her. She seemed to feel his eyes on her. She turned and looked directly at him. Their eyes met. Michael expected her to look away, but she didn't. She smiled at him - a slow, confident smile.",
                            "paragraph2": "Michael was surprised. Most people looked away when they realized a police detective was watching them. But this woman seemed to enjoy it. Michael felt something strange in his chest - a mix of professional curiosity and something more personal that he didn't want to admit.",
                            "paragraph3": "Elena finished her meal and paid Joe. As she walked out of the diner, she passed close to Michael's table. She stopped for a moment beside him. 'It's not polite to stare, Detective,' she said quietly. Then she walked out.",
                            "paragraph4": "Michael sat still, surprised. How did she know he was a detective? He hadn't introduced himself. And why wasn't she nervous around him like most strangers were?",
                            "paragraph5": "The next morning, Michael went to the police station early. He called a friend who worked for the state police. 'Dave, can you check a name for me? Elena Santos. Just arrived in Riverside yesterday.'",
                            "paragraph6": "While he waited for information, Michael drove past the Blue Moon Hotel. Elena was outside, wearing a simple black dress today. She was talking to Thomas Hill, the richest man in town. Thomas owned most of the businesses in Riverside. He was in his 60s, powerful, and married to a woman who was active in all the town's social events."
                        }
                    ],
                    "page4": [
                        {
                            "paragraph1": "Michael parked his car where he could watch them. Thomas seemed completely focused on Elena. He smiled more than Michael had ever seen. Then Thomas took something from his pocket and gave it to Elena. It looked like a key.",
                            "paragraph2": "Michael's phone rang. It was Dave. 'Michael, I checked Elena Santos. There's almost nothing on her. No criminal record. But also no work history, no address history. It's like she appeared out of nowhere five years ago.'",
                            "paragraph3": "'That's impossible,' Michael said. 'Everyone has a history.'",
                            "paragraph4": "'This woman doesn't. Or she's hiding it very well. Be careful, Michael.'",
                            "paragraph5": "That afternoon, Michael saw Elena again. She was entering Riverside Bank. A few minutes later, she came out with the bank manager, Henry Davis. Henry was usually a serious, professional man. But with Elena, he was smiling and attentive.",
                            "paragraph6": "Michael decided to follow her. She went to the town library, then to a small coffee shop. Everywhere she went, men paid attention to her. They opened doors, offered help, smiled too much. Women watched her with suspicious or jealous eyes."
                        }
                    ],
                    "page5": [
                        {
                            "paragraph1": "At the coffee shop, Elena suddenly turned and looked directly at the window where Michael stood outside. She waved at him to come in. Michael was embarrassed to be caught, but he went inside.",
                            "paragraph2": "'Detective Parker, if you want to know about me, why not just ask?' Elena said when he approached her table. She pointed to the empty chair across from her.",
                            "paragraph3": "Michael sat down. 'How do you know my name?'",
                            "paragraph4": "Elena laughed. It was a warm sound that made people at other tables look over. 'In a town this small, it's easy to learn things. I know you're divorced, you live alone, and you became a detective because your father was one.'",
                            "paragraph5": "Michael felt uncomfortable. He was supposed to be the one asking questions. 'Why are you in Riverside, Ms. Santos?'",
                            "paragraph6": "'Elena, please. I'm here because I needed a quiet place. My last town became... complicated.' Her dark eyes held secrets. Michael wanted to know them all.",
                            "paragraph7": "'Complicated how?' he asked.",
                            "paragraph8": "Elena's smile disappeared. For a moment, she looked sad. 'People often misunderstand me, Detective. They think I use my... charm... to get what I want. But sometimes charm is just a way to protect yourself in a world that can be cruel to women alone.'",
                            "paragraph9": "Before Michael could ask more questions, Elena stood up. 'I have an appointment. But I'm sure we'll meet again, Detective Parker.' She left money for her coffee and walked out, leaving Michael with more questions than answers."
                        }
                    ]
                }
            ],
            "episode2": [
                {
                    "page1": [
                        {
                            "paragraph1": "One week after Elena arrived in Riverside, things began to change. Thomas Hill, the rich businessman who Michael had seen giving Elena a key, suddenly announced he was donating money to rebuild the old community center. This was surprising because Thomas was known for keeping his money, not sharing it.",
                            "paragraph2": "Henry Davis, the bank manager, approved loans for three small businesses that he had rejected before. The library received new books. The elementary school got new computers.",
                            "paragraph3": "Michael noticed these changes with interest. Each time, he found a connection to Elena. She had been seen talking to these men before they made their surprising decisions. But was she really influencing them? And if yes, how? And why?",
                            "paragraph4": "The women of Riverside had different ideas. Whispers began in the beauty salon, at the grocery store, in the church after Sunday service. 'She must be blackmailing them,' some said. 'No, she's using her body to get what she wants,' others suggested. 'I heard she practices witchcraft,' said Mrs. Wilson from the hotel.",
                            "paragraph5": "Michael heard these rumors but didn't believe them. He had met Elena several more times that week. Each time, he felt more curious about her. She never really answered his questions, but she asked many about him. And strangely, he found himself answering."
                        }
                    ],
                    "page2": [
                        {
                            "paragraph1": "On Friday night, Michael went to Joe's Diner for dinner. Elena was there, sitting with the town's young doctor, Robert Lee. They were laughing together. Michael felt a strange feeling that he didn't want to call jealousy.",
                            "paragraph2": "He sat at the counter, trying not to look at them. Joe came to take his order. 'The usual, Detective?' Joe asked.",
                            "paragraph3": "Michael nodded. While he waited for his food, Beth Miller came into the diner. Beth was Thomas Hill's secretary, a quiet woman in her forties. She looked around the diner, saw Elena with the doctor, and walked directly to their table.",
                            "paragraph4": "'You need to stay away from the men in this town,' Beth said loudly to Elena. The diner became quiet. Everyone watched.",
                            "paragraph5": "Elena looked at Beth calmly. 'I'm just having dinner with a friend, Ms. Miller.'",
                            "paragraph6": "'Friend? Is that what you call it? You've been here one week, and already half the men in town are acting crazy. What did you do to Mr. Hill? He's giving away money like water!'",
                            "paragraph7": "Dr. Lee stood up. 'Beth, please. You're making a scene.'",
                            "paragraph8": "Beth ignored him. 'She's dangerous,' Beth said, looking around at the other customers. 'We don't know anything about her. Where she came from. What she wants.'"
                        }
                    ],
                    "page3": [
                        {
                            "paragraph1": "Michael decided to intervene. He walked to Beth and touched her arm gently. 'Beth, let's talk outside,' he said.",
                            "paragraph2": "Beth looked at him with angry eyes. 'You too, Detective? Has she got to you too?' But she allowed Michael to lead her outside.",
                            "paragraph3": "In the parking lot, Beth began to cry. 'I've worked for Mr. Hill for fifteen years,' she said. 'He never listened to my ideas. Never. Then this woman arrives, talks to him for ten minutes, and suddenly he's funding the women's shelter I've been asking him to support for years!'",
                            "paragraph4": "Michael was surprised. 'The community center will be a women's shelter?'",
                            "paragraph5": "Beth nodded. 'Part of it. It was my idea, but now everyone thinks it's because of her.'",
                            "paragraph6": "Inside the diner, Elena excused herself from the doctor's table and came outside. She approached Beth without fear. 'Ms. Miller,' she said softly. 'I think we should talk.'",
                            "paragraph7": "Beth wiped her tears. 'I have nothing to say to you.'",
                            "paragraph8": "Elena continued anyway. 'I didn't ask Mr. Hill to fund your shelter. I asked him why a man with so much money does so little for his town. I suggested that perhaps there were people close to him with good ideas that he never listened to. I mentioned you specifically.'"
                        }
                    ],
                    "page4": [
                        {
                            "paragraph1": "Beth looked at Elena with disbelief. 'Why would you do that? You don't know me.'",
                            "paragraph2": "Elena's face was serious now, without her usual smile. 'I know what it's like to have ideas ignored because you're a woman. I know what it's like to need a safe place. Your shelter is important, Ms. Miller.'",
                            "paragraph3": "Beth didn't know what to say. Finally, she just nodded and walked to her car. Michael watched her drive away, then turned to Elena. 'That was... unexpected,' he said.",
                            "paragraph4": "Elena looked tired suddenly. 'People always assume the worst about a woman on her own, Detective Parker. Especially one who doesn't act the way they expect.'",
                            "paragraph5": "Dr. Lee came out of the diner. 'Is everything okay?' he asked Elena.",
                            "paragraph6": "'Yes, Robert. But I think I'll go back to the hotel now. I have a headache.'",
                            "paragraph7": "'I'll drive you,' both men said at the same time. They looked at each other with surprise.",
                            "paragraph8": "Elena smiled a little. 'Thank you, Robert, but I think I need to talk to the detective. Professional matters.' The doctor looked disappointed but nodded and went back inside."
                        }
                    ],
                    "page5": [
                        {
                            "paragraph1": "In Michael's car, Elena was quiet for a while. Then she said, 'You've been investigating me.'",
                            "paragraph2": "It wasn't a question, but Michael answered anyway. 'Yes. It's my job when someone new comes to town and things start changing.'",
                            "paragraph3": "'And what have you found?'",
                            "paragraph4": "'Nothing before five years ago. It's like you didn't exist.'",
                            "paragraph5": "Elena looked out the window at the dark streets. 'Maybe I didn't, in a way. Five years ago, I was someone else. Someone afraid. Someone hurt.'",
                            "paragraph6": "Michael wanted to ask more, but they had reached the Blue Moon Hotel. Elena turned to him before getting out of the car. 'Detective Parker, not all mysteries need to be solved. Some just need to be understood.' She touched his hand lightly, then left.",
                            "paragraph7": "That night, Michael couldn't sleep. He kept thinking about Elena. Was she manipulating people for some secret purpose? Or was she really just helping the town in her strange way? And why did she have no past before five years ago?",
                            "paragraph8": "The next morning, Michael went to his office early. On his desk was a brown envelope that hadn't been there the night before. Inside was a newspaper article from five years ago, from a city three hundred miles away. The headline read: 'Local Businessman's Wife Missing, Foul Play Suspected.' There was a photo of a woman who looked like Elena, but with short blonde hair and fearful eyes. The name under the photo was 'Maria Collins.'"
                        }
                    ]
                }
            ],
            "episode3": [
                {
                    "page1": [
                        {
                            "paragraph1": "Michael stared at the newspaper article for a long time. The woman in the photo was definitely Elena, though she looked very different with blonde hair and without her confident smile. According to the article, Maria Collins had disappeared after accusing her wealthy husband, James Collins, of abuse. James had claimed his wife was mentally unstable and had probably run away.",
                            "paragraph2": "Michael searched online for more information. James Collins was a powerful businessman in the city of Westfield. After his wife disappeared, police investigated but found no evidence of foul play. The case was still officially open, but inactive.",
                            "paragraph3": "Later that morning, Michael drove to the Blue Moon Hotel. Mrs. Wilson told him that Elena had gone out early. 'She goes walking by the river every morning,' Mrs. Wilson said. Her voice was less hostile than before. 'She's not as bad as I thought. Yesterday she helped me carry groceries and fixed my broken lamp.'",
                            "paragraph4": "Michael thanked her and drove to the river path. He found Elena sitting on a bench, watching the water. She wore jeans and a simple white shirt today – very different from her usual dresses. Without makeup, she looked younger and more vulnerable.",
                            "paragraph5": "'Maria Collins,' Michael said as he sat beside her.",
                            "paragraph6": "Elena didn't seem surprised. She kept looking at the river. 'I wondered when you would find out.'",
                            "paragraph7": "'You left the article on my desk?'"
                        }
                    ],
                    "page2": [
                        {
                            "paragraph1": "'Yes. I thought it was time you knew.'",
                            "paragraph2": "'Why not just tell me?'",
                            "paragraph3": "'Because, Detective Parker, official statements can be dangerous. Papers have records. Records can be found.'",
                            "paragraph4": "'You think your husband is still looking for you?'",
                            "paragraph5": "Elena – or Maria – finally turned to look at him. 'James never accepts losing anything that he considers his property. And that's how he saw me – as property.'",
                            "paragraph6": "Michael saw a faint scar near her hairline that her usual hairstyle kept hidden. 'He hurt you,' Michael said. It wasn't a question.",
                            "paragraph7": "'For three years. At first, it was just control – where I went, who I saw, what I wore. Then it became criticism, then yelling. Finally, it was his fists.' She said all this without emotion, like she was talking about someone else.",
                            "paragraph8": "'Why didn't you go to the police?'",
                            "paragraph9": "Elena laughed without humor. 'I did. Twice. The first time, the officer was one of James's golf friends. The second time, they took my statement but never followed up. James donated a new wing to the local hospital the next month. He had connections everywhere.'"
                        }
                    ],
                    "page3": [
                        {
                            "paragraph1": "'So you ran,' Michael said.",
                            "paragraph2": "'I planned for months. Saved small amounts of money. Created a new identity. Then one night, after he had fallen asleep, I left. I've been moving from town to town ever since, never staying long enough to be found.'",
                            "paragraph3": "'Why Riverside?'",
                            "paragraph4": "'Small towns can be safe if the people accept you. And I was tired of running.' She looked at Michael directly. 'Are you going to report me?'",
                            "paragraph5": "Michael thought for a moment. 'You haven't committed any crime. Changing your name isn't illegal in your situation. The missing persons case is still open, but as you're an adult who left voluntarily...'",
                            "paragraph6": "'Thank you,' she said quietly.",
                            "paragraph7": "'But I still don't understand something. Since you've been here, you've been... influencing people. Thomas Hill, Henry Davis, others. Why?'",
                            "paragraph8": "Elena looked back at the river. 'When you've been powerless, you learn to recognize power in others. You learn how it works. How it can be used. Or abused.'",
                            "paragraph9": "'And?'",
                            "paragraph10": "'And I decided to use what I know to help others. Thomas Hill had the power to help this town but chose not to. I simply... encouraged him to be better.'"
                        }
                    ],
                    "page4": [
                        {
                            "paragraph1": "'By using your charm,' Michael said, still not entirely convinced.",
                            "paragraph2": "Elena shook her head. 'By showing him what he was missing. Powerful men often stop seeing the people around them as real. They forget that their actions affect lives. I remind them.'",
                            "paragraph3": "'And that's all?'",
                            "paragraph4": "'Isn't that enough?' She stood up. 'Walk with me, Detective.'",
                            "paragraph5": "They walked along the river path. It was a beautiful spring day. Birds sang in the trees. After a while, Elena spoke again. 'You know what I discovered after I escaped from James? That I'm good at reading people. At understanding what they want and fear. James saw this as a threat. But it can be a gift too.'",
                            "paragraph6": "'Like with Beth Miller,' Michael said. 'You knew she needed recognition for her work.'",
                            "paragraph7": "'Yes. And I knew Thomas Hill needed to feel important in a different way – not just as a rich man, but as someone who helps others. We all have needs that go beyond money or power, Detective.'",
                            "paragraph8": "'Michael,' he said. 'I think after all this, you can call me Michael.'"
                        }
                    ],
                    "page5": [
                        {
                            "paragraph1": "Elena smiled – a real smile that reached her eyes. 'Michael.'",
                            "paragraph2": "They walked in comfortable silence for a while. Then Michael asked, 'Will you stay in Riverside now?'",
                            "paragraph3": "'I don't know. It depends.'",
                            "paragraph4": "'On what?'",
                            "paragraph5": "'On whether I can truly be safe here. On whether people will accept me once they know my story – or parts of it, at least.'",
                            "paragraph6": "'I think they will,' Michael said. He hesitated, then added, 'I would help make sure of it.'",
                            "paragraph7": "Elena stopped walking and turned to him. 'Why would you do that?'",
                            "paragraph8": "Michael wasn't sure how to answer. Was it because he admired her courage? Because he felt protective of her? Or was it something more personal that he wasn't ready to admit? 'Because it's the right thing to do,' he finally said.",
                            "paragraph9": "Elena studied his face. 'You're an unusual policeman, Michael Parker.'",
                            "paragraph10": "'And you're an unusual woman, Elena Santos. Or Maria Collins. Or whoever you choose to be now.'",
                            "paragraph11": "'I think I'm finally just myself,' she said softly. 'No more hiding.'",
                            "paragraph12": "As they turned to walk back to town, neither noticed the black car parked at the far end of the river path. Nor did they see the man inside taking photos of them with a long-range camera."
                        }
                    ]
                }
            ],
            "episode4": [
                {
                    "page1": [
                        {
                            "paragraph1": "The next few weeks were the happiest Elena had known in years. She stopped moving from person to person in town and allowed herself to become part of the community. She volunteered at the library. She helped with plans for the new women's shelter. She even joined the committee for the town's spring festival.",
                            "paragraph2": "And she spent time with Michael. They had dinner together. They walked by the river. They talked about books, movies, and their lives – though Elena still kept many details of her past private.",
                            "paragraph3": "Michael found himself thinking about Elena all the time. He hadn't felt this way about anyone since before his divorce five years ago. Elena made him laugh. She challenged him. She saw things in people that others missed.",
                            "paragraph4": "The town noticed their relationship. Some people approved. Others worried. 'She's changing him,' Mrs. Wilson told her friends at their weekly card game. 'He smiles more now.'",
                            "paragraph5": "'But can we trust her?' asked another woman. 'She appeared from nowhere with no past.'",
                            "paragraph6": "'Sometimes the past is best left behind,' Mrs. Wilson said, surprising herself with her defense of Elena. 'She's good for him. And for this town.'"
                        }
                    ],
                    "page2": [
                        {
                            "paragraph1": "One evening, Michael and Elena were having dinner at a small restaurant in the next town over. They had driven there for privacy, away from the curious eyes of Riverside.",
                            "paragraph2": "'I have something for you,' Michael said after they finished eating. He gave Elena a small box.",
                            "paragraph3": "Inside was a key. 'What's this?' Elena asked.",
                            "paragraph4": "'A key to my house,' Michael said. 'I'm not suggesting you move in. I just want you to have a place you can go anytime. A safe place.'",
                            "paragraph5": "Elena touched the key gently. No one had offered her safety like this before. 'Thank you,' she said softly.",
                            "paragraph6": "On the drive back to Riverside, they were both quiet, comfortable in each other's company. Then Michael's phone rang. He answered using the car's speaker system. 'Parker here.'",
                            "paragraph7": "'Michael, it's Dave from State Police. That name you asked me about weeks ago – Elena Santos? We just got a hit. She's actually Maria Collins, reported missing five years ago. But here's the thing: her husband James Collins was just found dead in his home.'"
                        }
                    ],
                    "page3": [
                        {
                            "paragraph1": "Michael's hands tightened on the steering wheel. He glanced at Elena, who had gone very still. 'When?' Michael asked.",
                            "paragraph2": "'Yesterday. Apparent suicide. But the local police have questions. They're looking for the wife as a person of interest.'",
                            "paragraph3": "'Thanks for the heads-up, Dave. I'll let you know if I hear anything.' Michael hung up.",
                            "paragraph4": "The car was silent for a long moment. Finally, Elena spoke. 'I didn't do it. I haven't been near Westfield in five years.'",
                            "paragraph5": "'I know,' Michael said. And he did know. Besides the fact that Elena had been in Riverside, visible to many people every day, he trusted her.",
                            "paragraph6": "'But they'll come looking for me,' Elena said. Her voice was calm, but Michael could see fear in her eyes.",
                            "paragraph7": "'We'll figure this out,' Michael promised. 'We'll prove you were here.'",
                            "paragraph8": "When they reached Riverside, Michael drove Elena to the Blue Moon Hotel. 'Pack a bag,' he said. 'You'll stay at my place tonight. It's safer.'",
                            "paragraph9": "While Elena packed, Michael waited in the lobby. His phone rang again. This time it was an unknown number. 'Detective Parker,' he answered."
                        }
                    ],
                    "page4": [
                        {
                            "paragraph1": "'Detective, this is Detective Lisa Huang from Westfield Police. I understand you've been asking about Maria Collins, also known as Elena Santos.'",
                            "paragraph2": "Michael chose his words carefully. 'I made some inquiries, yes.'",
                            "paragraph3": "'Is she in Riverside?'",
                            "paragraph4": "'May I ask why you're looking for her?'",
                            "paragraph5": "'Her husband was found dead yesterday. Gunshot wound to the head. Initial evidence suggested suicide, but we've found some inconsistencies. We need to speak with Mrs. Collins.'",
                            "paragraph6": "'I understand,' Michael said. 'But if she is here, what assurance can you give that she'll be treated fairly? My understanding is that her previous attempts to get help from Westfield Police were ignored.'",
                            "paragraph7": "Detective Huang was quiet for a moment. 'Things are different now. James Collins' business practices have been under federal investigation for months. Several Westfield officers are also being investigated for corruption. I'm part of a new team brought in to clean things up.'",
                            "paragraph8": "'I see,' Michael said. 'If I locate Ms. Collins, I'll have her contact you.'"
                        }
                    ],
                    "page5": [
                        {
                            "paragraph1": "After he hung up, Elena came downstairs with her bag. She could see from Michael's face that something was wrong. 'Another call about James?' she asked.",
                            "paragraph2": "Michael nodded and explained about Detective Huang. 'She seems legitimate, but we should be careful.'",
                            "paragraph3": "At Michael's house, Elena sat at the kitchen table while he made tea. 'Tell me about the day you left James,' Michael said.",
                            "paragraph4": "Elena wrapped her hands around the warm cup. 'It was our anniversary. Three years of marriage. James had been drinking. He was angry because dinner wasn't what he wanted. He hit me harder than usual. I fell and hit my head on the corner of the table.' She touched the scar near her hairline. 'When I woke up, he was asleep. I took the emergency bag I had hidden, some cash I had saved, and left. I never went back.'",
                            "paragraph5": "'What was in the wooden box you brought to Riverside?' Michael asked. 'The one with the lock but no key?'",
                            "paragraph6": "Elena looked surprised. 'How do you know about that?'",
                            "paragraph7": "'Mrs. Wilson mentioned it. She cleans the rooms.'",
                            "paragraph8": "Elena was quiet for a moment. Then she said, 'Evidence. Against James. Financial records showing illegal activities. Photos of my injuries. A journal I kept. And a gun.'",
                            "paragraph9": "'A gun?' Michael was surprised.",
                            "paragraph10": "'James's gun. I took it when I left so he couldn't use it to find me. I've carried it with me all these years, never using it, but keeping it safe.'",
                            "paragraph11": "'Where is the box now?'",
                            "paragraph12": "'At the hotel. Hidden under a loose floorboard in my room.'",
                            "paragraph13": "'We need to get it,' Michael said. 'Now.'"
                        }
                    ]
                }
            ],
            "episode5": [
                {
                    "page1": [
                        {
                            "paragraph1": "Michael and Elena returned to the Blue Moon Hotel. The night clerk gave them a strange look but handed over Elena's room key without questions. In room 12, Elena moved the bed and pulled up a loose floorboard. The space below was empty.",
                            "paragraph2": "'It's gone,' Elena whispered. Her face was pale. 'The box is gone.'",
                            "paragraph3": "'When did you last see it?' Michael asked, already looking around the room for any signs of who might have taken it.",
                            "paragraph4": "'This morning, before I went out. I check it every day.'",
                            "paragraph5": "Michael examined the door lock. There were small scratches that suggested someone had picked it. 'We need to call Detective Huang now,' he said. 'If someone took that box with the gun...'",
                            "paragraph6": "'They could frame me for James's murder,' Elena finished. She sat heavily on the bed. 'It's happening again. James is controlling my life even from the grave.'",
                            "paragraph7": "Michael sat beside her and took her hand. 'Not this time. This time you're not alone.'",
                            "paragraph8": "They called Detective Huang and explained the situation. She listened carefully. 'This matches some of our findings,' she said. 'James Collins' death initially looked like suicide, but the gun that killed him was registered in his name yet had been reported missing five years ago. And we found evidence that someone had been in the house before his death – someone who knew exactly where to find certain documents.'"
                        }
                    ],
                    "page2": [
                        {
                            "paragraph1": "'Do you have security cameras at the hotel?' Huang asked.",
                            "paragraph2": "Michael shook his head, then remembered she couldn't see him. 'No, it's a small place. But let me check something.' He went to the window and looked out at the parking lot. 'The bank across the street has cameras. They might have recorded someone entering the hotel today.'",
                            "paragraph3": "After hanging up, Michael used his police authority to get the bank's security footage. He and Elena watched it at the police station. At 2:14 PM, a man in a dark suit entered the Blue Moon Hotel. His face wasn't visible to the camera.",
                            "paragraph4": "'He's familiar,' Elena said, watching the man's walk. 'Something about how he moves...'",
                            "paragraph5": "The man left the hotel twenty minutes later, carrying what looked like Elena's wooden box. He got into a black car – the same car that Michael now remembered seeing at the river path weeks ago.",
                            "paragraph6": "'I know who it is,' Elena said suddenly. 'It's Peter Walsh – James's head of security. He's worked for James for years. He would do anything for him.'",
                            "paragraph7": "'But James is dead,' Michael said, confused.",
                            "paragraph8": "'Unless he isn't,' Elena said quietly. 'Unless this is all part of a plan to find me.'",
                            "paragraph9": "Michael called Detective Huang again and told her about Peter Walsh. 'We know him,' Huang confirmed. 'He's missing too. And there's more – the body we found at Collins' house... the DNA results just came back. It's not James Collins.'"
                        }
                    ],
                    "page3": [
                        {
                            "paragraph1": "Elena's hand shook as she set down her coffee cup. 'Then he's alive. And he knows where I am.'",
                            "paragraph2": "'We'll protect you,' Michael promised. 'I'll call the state police for backup.'",
                            "paragraph3": "Before he could make the call, the station's front door opened. Thomas Hill walked in, looking agitated. 'Detective Parker, I need to speak with you. It's urgent.' Then he saw Elena. 'Oh. You're here too. Good.'",
                            "paragraph4": "'What is it, Mr. Hill?' Michael asked, instantly alert.",
                            "paragraph5": "'A man came to my office today. He said he was an old friend of Ms. Santos – or Ms. Collins, as he called her. He wanted to surprise her. Asked where she was staying, her habits. I didn't tell him anything, but he left his card in case I changed my mind.' Thomas handed Michael a business card.",
                            "paragraph6": "The card was simple and elegant. It read: 'James Collins, CEO, Collins Enterprises.' And below that, a handwritten note: 'I always find what belongs to me.'",
                            "paragraph7": "Michael looked at Elena. Her face was pale but determined. 'No more running,' she said. 'It ends here.'",
                            "paragraph8": "'Elena, he's dangerous,' Michael warned.",
                            "paragraph9": "'So am I,' Elena replied. 'I've learned a lot in five years. Including that some men only understand power.'"
                        }
                    ],
                    "page4": [
                        {
                            "paragraph1": "They formed a plan. With help from Detective Huang, who was driving to Riverside, and Dave from the state police, they set a trap. Elena would stay in Michael's house, which would be secretly guarded. They would let James think his intimidation was working.",
                            "paragraph2": "That evening, Elena sat alone in Michael's living room. The house looked empty from outside, with just one light on. Michael and two state police officers were hidden in different rooms. Detective Huang was still an hour away.",
                            "paragraph3": "At 9:17 PM, the power to the house was cut. Elena remained calm in the sudden darkness. She heard a window being forced open in the kitchen. Then footsteps.",
                            "paragraph4": "A flashlight beam cut through the darkness. It found Elena sitting calmly in an armchair. 'Hello, James,' she said.",
                            "paragraph5": "James Collins stepped into the room. He was tall, handsome, and expensively dressed. 'Maria,' he said softly. 'You've been very difficult to find.'",
                            "paragraph6": "'That was the point,' Elena replied. 'And it's Elena now.'",
                            "paragraph7": "'You'll always be Maria to me. My Maria.'",
                            "paragraph8": "'I was never yours. That was your first mistake.'",
                            "paragraph9": "James smiled, but it didn't reach his eyes. 'You took something that belongs to me. The box. My gun. And some very private documents.'",
                            "paragraph10": "'Your man Peter already took the box,' Elena said. 'Isn't that enough?'",
                            "paragraph11": "'The box was empty, Maria. Where are the real documents?'"
                        }
                    ],
                    "page5": [
                        {
                            "paragraph1": "Elena smiled now. 'Safe. Where you'll never find them. I knew you might find me eventually, James. I've been preparing for years.'",
                            "paragraph2": "'Always so clever,' James said. 'But not clever enough.' He pulled out a gun – his gun, the one that had been in Elena's box. 'You should have used this when you had the chance. Now, tell me where the documents are, or your detective friend will have an unfortunate accident when he returns.'",
                            "paragraph3": "'The documents were sent to the FBI this morning,' came Michael's voice from the darkness. 'And you're surrounded, Collins.'",
                            "paragraph4": "James spun around, pointing the gun in the direction of Michael's voice. From another corner, a state police officer shouted, 'Drop the weapon!'",
                            "paragraph5": "For a moment, everything was still. Then James turned back to Elena, his gun aimed at her heart. 'If I can't have you, no one—'",
                            "paragraph6": "Two shots rang out simultaneously. James fell to the floor. Behind him stood Mrs. Wilson from the Blue Moon Hotel, holding a small pistol. And across the room was Michael, his police weapon drawn.",
                            "paragraph7": "Elena stared at Mrs. Wilson in shock. 'What... how...?'",
                            "paragraph8": "Mrs. Wilson tucked her gun into her sweater pocket. 'I know a woman running from an abusive man when I see one, dear. I've been there. When I saw that man take your box today, I followed him. Heard enough to understand. Then I called Detective Parker.'"
                        }
                    ],
                    "page6": [
                        {
                            "paragraph1": "Later, after the paramedics had taken James away (wounded but alive), after Detective Huang had arrived and taken statements, after Peter Walsh had been arrested trying to leave town, Elena and Michael sat on his porch steps.",
                            "paragraph2": "'It's over,' Michael said, taking her hand. 'James will go to prison for a long time – for the murder he staged, for the corruption Detective Huang uncovered, for attempting to kill you tonight.'",
                            "paragraph3": "'And me?' Elena asked. 'Maria Collins technically committed some crimes too. Identity fraud. Taking that gun.'",
                            "paragraph4": "'Detective Huang says no charges will be filed. Self-preservation isn't a crime. And the DA is more interested in James's network of corruption.'",
                            "paragraph5": "'So I'm free,' Elena said, as if testing how the words felt. 'Really free.'",
                            "paragraph6": "'What will you do now?' Michael asked, trying to keep his voice casual. 'Will you stay in Riverside?'",
                            "paragraph7": "Elena looked at the stars above them. 'For the first time, I can choose without fear. I can go anywhere.'",
                            "paragraph8": "'Or you could stay,' Michael said. 'The town needs you. The women's shelter will open next month. People here respect you.'",
                            "paragraph9": "'And you?' Elena asked. 'What do you need?'",
                            "paragraph10": "Michael turned to face her. 'I need someone who sees the truth in people. Who isn't afraid to use her power to help others. Who makes me laugh and think and feel... everything.'",
                            "paragraph11": "Elena smiled – her real smile that lit up her eyes. 'I think I can be that person. Not Maria. Not even Elena, exactly. Just me – whoever I choose to be now.'",
                            "paragraph12": "'I'd like to know her,' Michael said. 'The real you.'",
                            "paragraph13": "'You already do,' she said, and leaned forward to kiss him under the stars, a free woman at last."
                        }
                    ]
                }
            ]
        }
    ]
}