{
    "title": "Prom Night Surprise",
    "description": "Lily is excited for prom night until her date cancels at the last minute. Sad and alone, she must decide whether to stay home or go to prom anyway. What happens next surprises everyone, especially Lily.",
    "level": "Early Beginner",
    "genre": "romance, school life",
    "episodeQuantity": 6,
    "episodeTitles": [
        {
            "episode1": "The Bad News",
            "episode2": "Tears and Friends",
            "episode3": "A New Plan",
            "episode4": "Getting Ready",
            "episode5": "At the Prom",
            "episode6": "Dancing Stars"
        }
    ],
    "episodeContents": [
        {
            "episode1": [
                {
                    "page1": [
                        {
                            "paragraph1": "Lily looks at her phone. She reads the message again. Her eyes fill with tears.",
                            "paragraph2": "\"I can't go to prom with you. Sorry. - Jake\"",
                            "paragraph3": "Lily sits on her bed. Her blue prom dress hangs on the door. She buys it last month. It is beautiful and expensive.",
                            "paragraph4": "\"Why?\" she texts back.",
                            "paragraph5": "She waits. One minute. Five minutes. Ten minutes. No answer.",
                            "paragraph6": "Lily calls her best friend, Emma.",
                            "paragraph7": "\"Emma, Jake is not taking me to prom,\" Lily says.",
                            "paragraph8": "\"What? But prom is tomorrow!\" Emma says.",
                            "paragraph9": "\"I know. I have a dress. I have shoes. But now I have no date.\" Lily begins to cry.",
                            "paragraph10": "\"Don't cry, Lily. I have an idea. I am coming to your house now.\" Emma hangs up."
                        }
                    ]
                }
            ],
            "episode2": [
                {
                    "page1": [
                        {
                            "paragraph1": "Emma arrives at Lily's house with ice cream. Chocolate, Lily's favorite.",
                            "paragraph2": "\"Jake is not a good person,\" Emma says. \"You are better without him.\"",
                            "paragraph3": "\"But now I can't go to prom,\" Lily says. \"Everyone has a date.\"",
                            "paragraph4": "\"That's not true,\" Emma says. \"Many people go to prom alone or with friends.\"",
                            "paragraph5": "\"But I want a date,\" Lily says. \"I want to dance. I want pictures.\"",
                            "paragraph6": "Lily's mom walks into the room. \"What's wrong?\" she asks.",
                            "paragraph7": "\"Jake canceled our prom date,\" Lily says.",
                            "paragraph8": "\"Oh no,\" Mom says. She sits next to Lily. \"I'm sorry, honey.\"",
                            "paragraph9": "\"I have a beautiful dress, but no date,\" Lily says.",
                            "paragraph10": "\"Wait,\" Emma says suddenly. \"I have an idea! I know someone who doesn't have a date yet.\""
                        }
                    ]
                }
            ],
            "episode3": [
                {
                    "page1": [
                        {
                            "paragraph1": "\"Who?\" Lily asks. \"Who doesn't have a date?\"",
                            "paragraph2": "\"Max,\" Emma says with a smile.",
                            "paragraph3": "\"Max? From our math class?\" Lily asks.",
                            "paragraph4": "\"Yes! He is nice. And he is funny,\" Emma says.",
                            "paragraph5": "\"But... does he want to go to prom?\" Lily asks.",
                            "paragraph6": "\"Yes,\" Emma says. \"He buys a ticket, but he has no date. He is too shy to ask anyone.\"",
                            "paragraph7": "\"I don't know...\" Lily says.",
                            "paragraph8": "\"What do you have to lose?\" Mom asks.",
                            "paragraph9": "Lily thinks. Max is nice. He always helps her with math homework. And he has a nice smile.",
                            "paragraph10": "\"OK,\" Lily says. \"Call him.\"",
                            "paragraph11": "Emma smiles and takes out her phone. She calls Max and puts the phone on speaker.",
                            "paragraph12": "\"Hello?\" Max answers."
                        }
                    ]
                }
            ],
            "episode4": [
                {
                    "page1": [
                        {
                            "paragraph1": "\"Hi Max, it's Emma,\" Emma says. \"I'm with Lily. We have a question.\"",
                            "paragraph2": "\"OK...\" Max sounds confused.",
                            "paragraph3": "\"Do you have a date for prom?\" Emma asks.",
                            "paragraph4": "\"No, I don't,\" Max says. His voice is quiet.",
                            "paragraph5": "\"Lily doesn't have a date either,\" Emma says. \"Her date cancels today.\"",
                            "paragraph6": "\"That's terrible,\" Max says. \"I'm sorry, Lily.\"",
                            "paragraph7": "\"Thank you,\" Lily says. Her heart beats fast.",
                            "paragraph8": "\"So...\" Emma continues. \"Would you like to go to prom with Lily?\"",
                            "paragraph9": "There is silence. Lily feels nervous.",
                            "paragraph10": "\"I would love to,\" Max finally says. \"Is that OK with you, Lily?\"",
                            "paragraph11": "\"Yes,\" Lily says. \"It's perfect.\"",
                            "paragraph12": "\"Great!\" Max sounds happy. \"I can pick you up at 7:00.\"",
                            "paragraph13": "\"OK,\" Lily says. She is smiling now. \"See you tomorrow, Max.\""
                        }
                    ]
                }
            ],
            "episode5": [
                {
                    "page1": [
                        {
                            "paragraph1": "It is prom night. Lily looks in the mirror. Her blue dress shines. Her hair is up with small flowers in it.",
                            "paragraph2": "The doorbell rings. Lily's heart jumps.",
                            "paragraph3": "\"He's here!\" Mom calls.",
                            "paragraph4": "Lily walks downstairs slowly. Max stands at the door. He wears a black suit with a blue tie. The tie matches Lily's dress perfectly.",
                            "paragraph5": "\"Wow,\" Max says when he sees Lily. \"You look beautiful.\"",
                            "paragraph6": "Lily smiles. \"Thank you. You look nice too.\"",
                            "paragraph7": "Max gives Lily a small box. Inside is a corsage with white flowers.",
                            "paragraph8": "\"It's beautiful,\" Lily says. Max helps her put it on her wrist.",
                            "paragraph9": "Mom takes many pictures. Then Lily and Max go to his car.",
                            "paragraph10": "\"Are you nervous?\" Max asks as they drive.",
                            "paragraph11": "\"A little,\" Lily admits. \"But I'm happy too.\"",
                            "paragraph12": "\"Me too,\" Max says with a smile."
                        }
                    ]
                }
            ],
            "episode6": [
                {
                    "page1": [
                        {
                            "paragraph1": "The school gym looks magical. There are lights everywhere. Music plays loudly.",
                            "paragraph2": "Emma and her date meet Lily and Max at the door.",
                            "paragraph3": "\"You both look amazing!\" Emma says.",
                            "paragraph4": "They go inside. They see Jake with another girl. Lily feels sad for a moment.",
                            "paragraph5": "\"Do you want to dance?\" Max asks.",
                            "paragraph6": "\"Yes,\" Lily says.",
                            "paragraph7": "Max takes Lily's hand. They go to the dance floor. A slow song starts to play.",
                            "paragraph8": "Max is a good dancer. He holds Lily carefully. They move together with the music.",
                            "paragraph9": "\"I'm glad Jake canceled,\" Lily says.",
                            "paragraph10": "\"Really?\" Max asks, surprised.",
                            "paragraph11": "\"Yes,\" Lily says. \"Because now I'm here with you.\"",
                            "paragraph12": "Max smiles. His eyes are bright. He spins Lily around, and she laughs.",
                            "paragraph13": "Under the prom lights, they dance like stars. Lily forgets all about Jake. This night is perfect, just not in the way she expects.",
                            "paragraph14": "Sometimes, Lily thinks, the best surprises come when plans change."
                        }
                    ]
                }
            ]
        }
    ]
}