{
    "title": "The Perfect Match",
    "description": "Sara, a focused businesswoman agrees to a blind date leading to unexpected choices about what truly matters in life.",
    "level": "Beginner",
    "genre": "romance, slice of life",
    "episodeQuantity": 6,
    "episodeTitles": [
        {
            "episode1": "Just Work",
            "episode2": "The Blind Date",
            "episode3": "Unexpected",
            "episode4": "New Feelings",
            "episode5": "Hard Choice",
            "episode6": "What Matters"
        }
    ],
    "episodeContents": [
        {
            "episode1": [
                {
                    "page1": [
                        {
                            "paragraph1": "Sara sits at her desk at 8 PM. She is still working. Everyone else went home hours ago.",
                            "paragraph2": "Her phone rings. It is her friend Mia.",
                            "paragraph3": "'Are you still at work?' Mia asks.",
                            "paragraph4": "'Yes. I have a big project,' Sara says.",
                            "paragraph5": "'You always have a big project,' Mia says. 'You need a life outside work.'",
                            "paragraph6": "Sara sighs. 'I like my work. It's important.'",
                            "paragraph7": "'I know someone you should meet,' Mia says. 'His name is Leo. He's smart and nice.'",
                            "paragraph8": "'No,' Sara says quickly. 'No blind dates. I don't have time.'",
                            "paragraph9": "'Just one dinner,' Mia says. 'Then I'll stop asking.'",
                            "paragraph10": "Sara knows Mia won't stop asking. Mia never stops.",
                            "paragraph11": "'Fine. One dinner. Then no more blind dates,' Sara agrees.",
                            "paragraph12": "After the call, Sara goes back to work. She doesn't think about the blind date. It will be boring, like all dates. Work is better. Work makes sense."
                        }
                    ]
                }
            ],
            "episode2": [
                {
                    "page1": [
                        {
                            "paragraph1": "Friday night comes. Sara doesn't want to go on the date. She calls Mia.",
                            "paragraph2": "'I need to cancel. My boss wants the project done by Monday,' Sara says.",
                            "paragraph3": "'No,' Mia says. 'You promised. One dinner. Leo is already at the restaurant.'",
                            "paragraph4": "Sara feels bad. She doesn't want to be rude. 'OK. One quick dinner.'",
                            "paragraph5": "At the restaurant, Sara looks for a man alone. She sees someone at a corner table.",
                            "paragraph6": "He doesn't look like Sara expected. No suit. No tie. He wears a simple blue shirt. He reads a book while he waits.",
                            "paragraph7": "'Excuse me. Are you Leo?' Sara asks.",
                            "paragraph8": "The man looks up. He has kind eyes and a warm smile.",
                            "paragraph9": "'Yes. You must be Sara,' Leo says. 'Please, sit down.'",
                            "paragraph10": "Sara sits. She plans to eat fast and leave early. She will tell Leo she has work to do.",
                            "paragraph11": "'So, you work with Mia?' Sara asks. She will be polite first.",
                            "paragraph12": "'No,' Leo smiles. 'I'm a teacher. I teach art to children.'",
                            "paragraph13": "Sara is surprised. A teacher? Not a businessman? This is not what she expected at all."
                        }
                    ]
                }
            ],
            "episode3": [
                {
                    "page1": [
                        {
                            "paragraph1": "Sara and Leo talk during dinner. Sara forgets her plan to leave early.",
                            "paragraph2": "Leo tells stories about his students. His face lights up when he talks about art and children.",
                            "paragraph3": "'What about you?' Leo asks. 'Mia says you work a lot.'",
                            "paragraph4": "Sara starts to talk about her job. But her job sounds boring now. Just numbers and meetings.",
                            "paragraph5": "'I haven't made art since I was a child,' Sara says instead. 'I was too busy with school, then work.'",
                            "paragraph6": "'That's sad,' Leo says. 'Art is good for the soul.'",
                            "paragraph7": "Sara doesn't talk about 'soul' things. She talks about facts and plans. But she doesn't want to be rude.",
                            "paragraph8": "'Maybe,' she says. 'But art doesn't pay the bills.'",
                            "paragraph9": "Leo laughs. 'True. Teachers don't make much money. But I'm happy.'",
                            "paragraph10": "Happy. Sara thinks about this word. Is she happy? She is successful. She is respected. But happy?",
                            "paragraph11": "After dinner, Leo walks Sara to her car. 'I enjoyed tonight,' he says. 'Can I see you again?'",
                            "paragraph12": "Sara surprises herself. 'Yes,' she says. 'I'd like that.'"
                        }
                    ]
                }
            ],
            "episode4": [
                {
                    "page1": [
                        {
                            "paragraph1": "Over the next few weeks, Sara sees Leo many times. They go to dinner. They walk in the park. He takes her to an art museum.",
                            "paragraph2": "Sara finds herself thinking about Leo during work. This never happened before. Work was always her only thought.",
                            "paragraph3": "One Saturday, Leo takes Sara to his art classroom. No students today. Just them.",
                            "paragraph4": "'I want to show you something,' Leo says. He gives Sara paper and paints.",
                            "paragraph5": "'Oh no,' Sara says. 'I can't paint. I'm not creative.'",
                            "paragraph6": "Leo smiles. 'Everyone is creative. Some people just forget how to show it.'",
                            "paragraph7": "Sara feels nervous. She doesn't like to do things she's not good at.",
                            "paragraph8": "'Just try,' Leo says. 'No judgments. No right or wrong.'",
                            "paragraph9": "Sara starts to paint. At first, she feels silly. Then, slowly, she begins to enjoy it.",
                            "paragraph10": "Time passes quickly. Sara paints a sunset. It's not great art, but it's not bad.",
                            "paragraph11": "'See?' Leo says. 'You are creative.'",
                            "paragraph12": "Leo puts his arm around Sara. It feels right. Sara feels something new inside. Is this what happy feels like?"
                        }
                    ]
                }
            ],
            "episode5": [
                {
                    "page1": [
                        {
                            "paragraph1": "Monday morning at work, Sara's boss calls her to his office.",
                            "paragraph2": "'I have big news,' he says. 'We want you to lead the new office in London. It's a promotion. More money. More responsibility.'",
                            "paragraph3": "Before, this would be a dream for Sara. Now, she feels confused.",
                            "paragraph4": "'When would I start?' she asks.",
                            "paragraph5": "'Two weeks,' her boss says. 'You need to move to London, of course.'",
                            "paragraph6": "Sara thinks of Leo. Things are just starting between them. London is far away.",
                            "paragraph7": "'Can I think about it?' Sara asks.",
                            "paragraph8": "Her boss looks surprised. 'Think about it? This is a big opportunity. The Sara I know would say yes immediately.'",
                            "paragraph9": "The Sara he knows. The Sara she was. Is that still her?",
                            "paragraph10": "That night, Sara calls Mia. 'I got offered a big job in London,' she says.",
                            "paragraph11": "'Wow,' Mia says. 'Will you take it?'",
                            "paragraph12": "'Before Leo, yes. Now, I don't know,' Sara admits.",
                            "paragraph13": "'You really like him,' Mia says. It's not a question.",
                            "paragraph14": "'Yes,' Sara says. 'I really do.'"
                        }
                    ]
                }
            ],
            "episode6": [
                {
                    "page1": [
                        {
                            "paragraph1": "Sara meets Leo for dinner. She needs to tell him about London.",
                            "paragraph2": "'I got a job offer,' Sara says. 'In London. A big promotion.'",
                            "paragraph3": "Leo's smile fades. 'London is far away.'",
                            "paragraph4": "'Yes,' Sara says. 'I haven't decided yet.'",
                            "paragraph5": "Leo takes her hand. 'What do you want, Sara? Really want?'",
                            "paragraph6": "No one ever asked Sara this question before. Or maybe no one cared about her answer.",
                            "paragraph7": "'I always thought I wanted success,' Sara says slowly. 'A big career. Money. Respect.'",
                            "paragraph8": "'And now?' Leo asks.",
                            "paragraph9": "'Now I'm not sure. These weeks with you have been...' Sara searches for the right word. 'Different. Good different.'",
                            "paragraph10": "'I care about you, Sara,' Leo says. 'But I can't tell you what to do. This is your choice.'",
                            "paragraph11": "Sara thinks hard for three days. She makes lists of pros and cons. She doesn't sleep well.",
                            "paragraph12": "Finally, she goes to her boss's office. 'I've made my decision,' she says."
                        }
                    ]
                }
            ],
            "episode7": [
                {
                    "page1": [
                        {
                            "paragraph1": "Six months later, Sara sits at her desk. It's 5:30 PM. She finishes her work and closes her computer.",
                            "paragraph2": "'Leaving on time again?' her coworker asks.",
                            "paragraph3": "Sara smiles. 'Yes. I'm meeting Leo at 6.'",
                            "paragraph4": "Sara didn't take the London job. She asked for changes in her current job instead. Less overtime. More balance.",
                            "paragraph5": "Her boss was surprised but agreed. Good employees are hard to find.",
                            "paragraph6": "Sara walks to her car. Her phone rings. It's Mia.",
                            "paragraph7": "'Still coming to dinner Saturday?' Mia asks. 'Leo said you're bringing dessert.'",
                            "paragraph8": "'Yes,' Sara says. 'I'm trying a new recipe.'",
                            "paragraph9": "'You? Cooking?' Mia laughs. 'Leo really has changed you.'",
                            "paragraph10": "Sara thinks about this. Has Leo changed her? Or has he just helped her remember parts of herself she forgot?",
                            "paragraph11": "At the art studio, Leo teaches an evening class. Sara watches him with the students. He is patient and kind.",
                            "paragraph12": "Leo sees Sara and waves. His smile is warm, just for her.",
                            "paragraph13": "Sara feels that warmth inside again. It's still new, still surprising. But now she has a name for it.",
                            "paragraph14": "Happiness. Not from success or money. But from connection. From balance. From finding the perfect match for her heart, not just her resume."
                        }
                    ]
                }
            ]
        }
    ]
}