{
    "title": "The Guardian Cat",
    "description": "Tom discovers his cat has been watching over his family for generations, revealing a mystery that connects his past to his present.",
    "level": "Beginner",
    "genre": "mystery, magical realism",
    "episodeQuantity": 6,
    "episodeTitles": [
        {
            "episode1": "Old Photos",
            "episode2": "The Same Cat",
            "episode3": "Midnight Talk",
            "episode4": "Family Secret",
            "episode5": "The Lost Box",
            "episode6": "Guardians"
        }
    ],
    "episodeContents": [
        {
            "episode1": [
                {
                    "page1": [
                        {
                            "paragraph1": "Tom cleans his grandmother's house after her funeral. It is hard work. She kept many things.",
                            "paragraph2": "In the attic, Tom finds a box of old photos. He sits on the floor to look at them.",
                            "paragraph3": "Pictures of his parents when they were young. Pictures of his grandparents. Even some of his great-grandparents.",
                            "paragraph4": "Tom smiles at the old clothes and hairstyles. So much has changed.",
                            "paragraph5": "Then he notices something strange. A cat appears in many photos.",
                            "paragraph6": "A gray cat with black spots and one folded ear. In photos from the 1950s. In photos from the 1970s. Even in photos from the 1990s.",
                            "paragraph7": "It looks like the same cat. But that is not possible.",
                            "paragraph8": "Tom feels something soft touch his leg. He looks down.",
                            "paragraph9": "His grandmother's cat, Felix, sits beside him. Gray with black spots. One folded ear.",
                            "paragraph10": "Felix looks at the photos, then at Tom. The cat's yellow eyes seem too... knowing.",
                            "paragraph11": "Tom shakes his head. 'Just my imagination,' he says. 'Cats don't live that long.'"
                        }
                    ]
                }
            ],
            "episode2": [
                {
                    "page1": [
                        {
                            "paragraph1": "Tom decides to take Felix home. The cat needs a new home, and Tom lives alone.",
                            "paragraph2": "At night, Tom looks at the old photos again. The cat in the pictures really does look exactly like Felix.",
                            "paragraph3": "Tom finds more photos. His grandmother as a child with the same cat. That would be 80 years ago.",
                            "paragraph4": "He searches online. Cats live 15 years, maybe 20. Not 80 years. Not possible.",
                            "paragraph5": "'Maybe it's a family cat. Same breed, same markings,' Tom says to Felix, who watches from the couch.",
                            "paragraph6": "But the fold in the left ear is the same. The pattern of black spots is the same.",
                            "paragraph7": "Tom tries to sleep, but he keeps thinking about the cat.",
                            "paragraph8": "At midnight, Tom hears a noise from the kitchen. He gets up to check.",
                            "paragraph9": "Felix sits on the kitchen table, looking at more old photos Tom left there.",
                            "paragraph10": "'Those were good years,' a voice says. 'Your grandmother was a kind woman.'",
                            "paragraph11": "Tom freezes. No one else is in the apartment. The voice came from... Felix?",
                            "paragraph12": "The cat turns and looks at Tom. 'We need to talk,' Felix says. 'It's time you knew.'"
                        }
                    ]
                }
            ],
            "episode3": [
                {
                    "page1": [
                        {
                            "paragraph1": "Tom sits at the kitchen table. His hands shake. The cat just talked.",
                            "paragraph2": "'I'm not crazy,' Tom says. 'Cats don't talk.'",
                            "paragraph3": "'Most don't,' Felix says. His mouth doesn't move much, but the words are clear. 'I'm not an ordinary cat.'",
                            "paragraph4": "Tom takes a deep breath. 'Those photos... that was you?'",
                            "paragraph5": "Felix jumps onto the table and puts his paw on a photo from 1952. 'Yes. I've been with your family for generations.'",
                            "paragraph6": "Tom touches his head. 'I need coffee for this conversation.'",
                            "paragraph7": "With coffee in his hand, Tom feels braver. 'What are you? Some kind of magic cat?'",
                            "paragraph8": "'I'm a guardian,' Felix says. 'Some families have us. We watch. We protect.'",
                            "paragraph9": "'Protect from what?' Tom asks.",
                            "paragraph10": "'Different things. Bad luck. Bad people. But mostly, we protect family treasures.'",
                            "paragraph11": "Felix walks across the table to another photo. Tom's grandmother as a young woman, holding a wooden box.",
                            "paragraph12": "'This box,' Felix says. 'It contains something important. And now, it's missing.'"
                        }
                    ]
                }
            ],
            "episode4": [
                {
                    "page1": [
                        {
                            "paragraph1": "Tom looks at the photo. A small wooden box with strange symbols.",
                            "paragraph2": "'What's in the box?' Tom asks.",
                            "paragraph3": "Felix sits down. 'A key. Not a normal key. It opens something important.'",
                            "paragraph4": "'What does it open?' Tom asks.",
                            "paragraph5": "'I can't tell you yet,' Felix says. 'First, we need to find the box.'",
                            "paragraph6": "Tom thinks. 'I didn't see it in Grandmother's house.'",
                            "paragraph7": "'No. Someone took it. Recently. Before she died.'",
                            "paragraph8": "Tom feels nervous. 'Who would take it?'",
                            "paragraph9": "'Someone who knows what it is,' Felix says. 'Your grandmother's friend, Martin, visited often before she got sick.'",
                            "paragraph10": "Tom remembers Martin. A quiet man who always brought his grandmother flowers.",
                            "paragraph11": "'Why would Martin take it?' Tom asks.",
                            "paragraph12": "'Some people collect special objects,' Felix explains. 'They think these objects give power.'",
                            "paragraph13": "'Do they?' Tom asks.",
                            "paragraph14": "Felix's yellow eyes look serious. 'Yes. And that's why we need to get the box back. Soon.'"
                        }
                    ]
                }
            ],
            "episode5": [
                {
                    "page1": [
                        {
                            "paragraph1": "The next day, Tom visits Martin's house. Felix comes too, hiding in Tom's backpack.",
                            "paragraph2": "Martin lives in a small house with many plants. He seems sad about Tom's grandmother.",
                            "paragraph3": "'She was special,' Martin says. 'A special friend.'",
                            "paragraph4": "Tom looks around for the box. He sees many books, many small objects on shelves.",
                            "paragraph5": "'I found old photos,' Tom says. 'And I'm looking for a small wooden box that belonged to my grandmother.'",
                            "paragraph6": "Martin's face changes. Just for a second. But Tom sees it.",
                            "paragraph7": "'I don't remember any box,' Martin says. But his eyes move to a shelf behind Tom.",
                            "paragraph8": "Tom feels Felix move in his backpack. The cat is trying to get out.",
                            "paragraph9": "'Excuse me. Can I use your bathroom?' Tom asks.",
                            "paragraph10": "In the bathroom, Tom lets Felix out of the backpack.",
                            "paragraph11": "'The box is here,' Felix whispers. 'I can feel it.'",
                            "paragraph12": "'What do we do?' Tom asks.",
                            "paragraph13": "'You distract. I'll find it,' Felix says."
                        }
                    ]
                }
            ],
            "episode6": [
                {
                    "page1": [
                        {
                            "paragraph1": "Tom goes back to Martin. He asks many questions about his grandmother.",
                            "paragraph2": "Martin talks and talks. He doesn't notice Felix moving around the house.",
                            "paragraph3": "After 20 minutes, Felix appears at the window. He looks at Tom and nods.",
                            "paragraph4": "'I should go,' Tom says. 'Thank you for the tea.'",
                            "paragraph5": "Outside, Tom finds Felix waiting with the small wooden box in his mouth.",
                            "paragraph6": "At home, Tom opens the box. Inside is an old key and a small paper.",
                            "paragraph7": "The paper has an address. It's the address of his grandmother's house.",
                            "paragraph8": "'I don't understand,' Tom says. 'The key is for her house? I already have that key.'",
                            "paragraph9": "Felix shakes his head. 'Not for the main house. Look in the garden.'",
                            "paragraph10": "The next day, they go to grandmother's house. In the back garden, behind some bushes, Tom finds a small door in the ground.",
                            "paragraph11": "The key fits. Inside is a small room with books and letters.",
                            "paragraph12": "'Your family history,' Felix says. 'The real history. Not all families are ordinary, Tom.'",
                            "paragraph13": "Tom reads about his ancestors. They were protectors of special knowledge.",
                            "paragraph14": "'And now?' Tom asks.",
                            "paragraph15": "'Now it's your turn,' Felix says. 'I'll help you learn. Just like I helped your grandmother. And her mother before her.'",
                            "paragraph16": "Tom looks at Felix. 'How long do guardian cats live?'",
                            "paragraph17": "Felix makes a sound like a laugh. 'Long enough. We have important work to do.'"
                        }
                    ]
                }
            ]
        }
    ]
}